SolutionApps/App.Solutions/App.WebAPIConfigService/App_Data/ApiLogFiles/UserLogFiles/PWM0Q7000E/EnhancedBookMultiSegmentRQ.log

<?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:eb="http://www.ebxml.org/namespaces/messageHeader"><soapenv:Header>  <eb:MessageHeader soapenv:mustUnderstand="1" eb:version="1.0">       <eb:From>           <eb:PartyId eb:type="urn: x12.org:IO5: 01">999999</eb:PartyId>       </eb:From>       <eb:To>           <eb:PartyId type="urn:x12.org:IO5:01">123123</eb:PartyId>       </eb:To>       <eb:CPAId>3RT2</eb:CPAId>       <eb:ConversationId>1111111111111111111</eb:ConversationId>       <eb:Service eb:type="sabreXML">EnhancedAirBookRQ</eb:Service>       <eb:Action>EnhancedAirBookRQ</eb:Action>       <eb:MessageData>           <eb:MessageId>mid:0_2014-09-22T21:43:40m</eb:MessageId>           <eb:Timestamp>2014-09-22T21:43:40</eb:Timestamp>           <eb:TimeToLive>2014-09-22T21:43:40</eb:TimeToLive>       </eb:MessageData>       <eb:DuplicateElimination/>       <eb:Description>Air Book Service</eb:Description>   </eb:MessageHeader>   <sec:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/12/utility">       <sec:BinarySecurityToken>Shared/IDL:IceSess\/SessMgr:1\.0.IDL/Common/!ICESMS\/RESG!ICESMSLB\/RES.LB!-3099905540887474293!464806!0</sec:BinarySecurityToken>   </sec:Security></soapenv:Header><soapenv:Body>    <EnhancedAirBookRQ  xmlns="http://services.sabre.com/sp/eab/v3_6"  version="3.6.0" IgnoreOnError="true" HaltOnError="false" >     <OTA_AirBookRQ>   <RetryRebook Option="true"/>   <HaltOnStatus Code="NO"/>   <HaltOnStatus Code="NN"/>   <HaltOnStatus Code="UC"/>   <HaltOnStatus Code="US"/>   <HaltOnStatus Code="WL"/>   <HaltOnStatus Code="HL"/>   <HaltOnStatus Code="UN"/>   <HaltOnStatus Code="PN"/>   <HaltOnStatus Code="LL"/>      <OriginDestinationInformation>   <FlightSegment DepartureDateTime="2018-11-09T21:55" ArrivalDateTime="2018-11-10T19:40" FlightNumber="140" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="AUH"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="EY" FlightNumber="140"/>      <OperatingAirline Code="EY"/>      <OriginLocation   LocationCode="YYZ"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-10T22:00" ArrivalDateTime="2018-11-11T03:00" FlightNumber="7602" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="DEL"/>      <Equipment AirEquipType="73H"/>      <MarketingAirline Code="EY" FlightNumber="7602"/>      <OperatingAirline Code="9W"/>      <OriginLocation   LocationCode="AUH"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-23T04:10" ArrivalDateTime="2018-11-23T06:45" FlightNumber="211" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="AUH"/>      <Equipment AirEquipType="789"/>      <MarketingAirline Code="EY" FlightNumber="211"/>      <OperatingAirline Code="EY"/>      <OriginLocation   LocationCode="DEL"/>     </FlightSegment>   <FlightSegment DepartureDateTime="2018-11-23T10:05" ArrivalDateTime="2018-11-23T15:30" FlightNumber="141" NumberInParty="1" ResBookDesigCode="U" Status="NN">      <DestinationLocation   LocationCode="YYZ"/>      <Equipment AirEquipType="77W"/>      <MarketingAirline Code="EY" FlightNumber="141"/>      <OperatingAirline Code="EY"/>      <OriginLocation   LocationCode="AUH"/>     </FlightSegment>      </OriginDestinationInformation>     <RedisplayReservation NumAttempts="2" WaitInterval="5000"/>     </OTA_AirBookRQ> <PostProcessing IgnoreAfter ="false">   <RedisplayReservation WaitInterval ="5000"/> </PostProcessing>    </EnhancedAirBookRQ>   </soapenv:Body></soapenv:Envelope>